In [20]:
import pandas as pd
import numpy as np
from pathlib import Path
import seaborn as sns
import matplotlib.pyplot as plt

In [21]:
# Replace BASE_DIR with the actual path to your project directory
BASE_DIR = Path("E:/Labmentrix/Projects/Project_8")

In [22]:
# take relative path to read the file
city = pd.read_excel(Path(BASE_DIR,r'data/raw/City.xlsx'))
continent = pd.read_excel(Path(BASE_DIR,r'data/raw/Continent.xlsx'))
country = pd.read_excel(Path(BASE_DIR,r'data/raw/Country.xlsx'))
item = pd.read_excel(Path(BASE_DIR,r'data/raw/Item.xlsx'))
visit_mode = pd.read_excel(Path(BASE_DIR,r'data/raw/Mode.xlsx'))
region = pd.read_excel(Path(BASE_DIR,r'data/raw/Region.xlsx'))
transaction = pd.read_excel(Path(BASE_DIR,r'data/raw/Transaction.xlsx'))
attraction_type = pd.read_excel(Path(BASE_DIR,r'data/raw/Type.xlsx'))
User = pd.read_excel(Path(BASE_DIR,r'data/raw/User.xlsx'))

In [23]:
city.head()

   CityId      CityName  CountryId
0       0             -          0
1       1        Douala          1
2       2  South Region          1
3       3     N'Djamena          2
4       4        Kigali          3

In [24]:
continent.head()

   ContinentId            Continent
0            0                    -
1            1               Africa
2            2              America
3            3                 Asia
4            4  Australia & Oceania

In [25]:
country.head()

   CountryId   Country  RegionId
0          0         -         0
1          1  Cameroon         1
2          2      Chad         1
3          3    Rwanda         1
4          4  Ethiopia         2

In [26]:
item.head()

,AttractionId,AttractionCityId,AttractionTypeId,Attraction,AttractionAddress
0,369,1,13,Kuta Beach - Bali,Kuta
1,481,1,13,Nusa Dua Beach,"Semenanjung Nusa Dua, Nusa Dua 80517 Indonesia"
2,640,1,63,Sacred Monkey Forest Sanctuary,"Jl. Monkey Forest, Ubud 80571 Indonesia"
3,650,1,13,Sanur Beach,Sanur
4,673,1,13,Seminyak Beach,Seminyak

In [27]:
visit_mode.head()

   VisitModeId VisitMode
0            0         -
1            1  Business
2            2   Couples
3            3    Family
4            4   Friends

In [28]:
region.head()

            Region  RegionId  ContinentId
0                -         0            0
1   Central Africa         1            1
2      East Africa         2            1
3     North Africa         3            1
4  Southern Africa         4            1

In [29]:
transaction.head()

,TransactionId,UserId,VisitYear,VisitMonth,VisitMode,AttractionId,Rating
0,3,70456,2022,10,2,640,5
1,8,7567,2022,10,4,640,5
2,9,79069,2022,10,3,640,5
3,10,31019,2022,10,3,640,3
4,15,43611,2022,10,2,640,3

In [30]:
User.head()

   UserId  ContinentId  RegionId  CountryId  CityId
0      14            5        20        155   220.0
1      16            3        14        101  3098.0
2      20            4        15        109  4303.0
3      23            1         4         22   154.0
4      25            3        14        101  3098.0

In [31]:
attraction_type.head()

   AttractionTypeId         AttractionType
0                 2          Ancient Ruins
1                10                Ballets
2                13                Beaches
3                19        Caverns & Caves
4                34  Flea & Street Markets

In [34]:
# using mysql and joins dataset have been merged and saved in processed folder for reference and details check notebooks\sql_import.ipynb
numeric_data = pd.read_csv(Path(BASE_DIR,r"data\processed\numeric_data.csv"), index_col="Unnamed: 0")
numeric_data.set_index("TransactionId",inplace=True)

In [35]:
numeric_data

,UserId,VisitYear,VisitMonth,VisitMode,Rating,user_continent_id,user_region_id,user_country_id,user_city_id,AttractionId,AttractionCityId,AttractionTypeId,attraction_countryid,attraction_regionid,attraction_continentid
TransactionId,,,,,,,,,,,,,,,
3,70456,2022,10,2,5,5,21,163,4341.0,640,1,63,1,1,1
8,7567,2022,10,4,5,2,8,48,464.0,640,1,63,1,1,1
9,79069,2022,10,3,5,2,9,54,774.0,640,1,63,1,1,1
10,31019,2022,10,3,3,5,17,135,583.0,640,1,63,1,1,1
15,43611,2022,10,2,3,5,21,163,1396.0,640,1,63,1,1,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
211227,87100,2018,9,2,4,5,21,159,7460.0,1297,3,44,2,1,1
211238,88112,2016,2,2,5,5,17,133,6164.0,1297,3,44,2,1,1
211239,88112,2016,2,2,4,5,17,133,6164.0,1297,3,44,2,1,1
211240,88112,2016,2,2,4,5,17,133,6164.0,1297,3,44,2,1,1
211241,88112,2016,2,2,5,5,17,133,6164.0,1297,3,44,2,1,1